05-sampling.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-11-18 Mon 16:35 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Sampling</title>
<meta name="generator" content="Org mode">
</head>
<body>
<div id="content">
<header>
<h1 class="title">Sampling</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2bd0184">1. Loading Sounds</a></li>
<li><a href="#org217885f">2. Playing Sounds</a></li>
</ul>
</div>
</nav>
<p>
In addition to its powerful library of oscillators and sound generators, SuperCollider also gives us the ability to use recorded sounds in our synths. In SuperCollider, a recorded sound is stored in a buffer object on the server. A buffer is effectively an array of numbers which can be of any length and can have one or more channels. It's possible to load a sound into a buffer from your hard drive, but it's also possible to record the output of a synth or UGen into a buffer directly on the server. A buffer can be played back normally, or you can control its rate and the playhead position with a UGen.
</p>

<div id="outline-container-org2bd0184" class="outline-2">
<h2 id="org2bd0184"><span class="section-number-2">1</span> Loading Sounds</h2>
<div class="outline-text-2" id="text-1">
<p>
To load a sound from the drive, use the <code>buffer-read</code> function, like so:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #268bd2;">(</span>buffer-read <span style="color: #2aa198;">"/path/to/your/file.wav"</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
This should be pretty self-explanatory; the only required parameter to <code>buffer-read</code> is the path to the file you want to load. SuperCollider has support for wav and aiff files, of any sample rate and any number of channels.
</p>
</div>
</div>

<div id="outline-container-org217885f" class="outline-2">
<h2 id="org217885f"><span class="section-number-2">2</span> Playing Sounds</h2>
<div class="outline-text-2" id="text-2">
<p>
Once you've loaded a sound, you'll probably want to play it. Here's an example SynthDef which illustrates the UGens you'd use to do that:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #268bd2;">(</span>defsynth <span style="color: #268bd2;">:sample</span> <span style="color: #d33682;">(</span><span style="color: #859900;">(</span>buffer 0<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>rate 1<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>start 0<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>amp 0.5<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>out 0<span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #859900;">let</span> <span style="color: #859900;">(</span><span style="color: #cb4b16;">(</span>sig <span style="color: #6c71c4;">(</span>play-buf.ar 2 buffer <span style="color: #b58900;">(</span>* rate <span style="color: #35a69c;">(</span>buf-rate-scale.ir buffer<span style="color: #35a69c;">)</span><span style="color: #b58900;">)</span>
                          <span style="color: #268bd2;">:start-pos</span> <span style="color: #b58900;">(</span>* start <span style="color: #35a69c;">(</span>buf-frames.ir buffer<span style="color: #35a69c;">)</span><span style="color: #b58900;">)</span>
                          <span style="color: #268bd2;">:act</span> <span style="color: #268bd2;">:free</span><span style="color: #6c71c4;">)</span><span style="color: #cb4b16;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span>out.ar out <span style="color: #cb4b16;">(</span>* amp sig<span style="color: #cb4b16;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
Typically, to tell the synth what buffer we want it to play, we would usually add a <code>buffer</code> or <code>bufnum</code> parameter to the synthdef. These are fairly standard names for buffer parameters in synths, and some libraries may expect a buffer to be passed to a synth via a parameter with one of these names. So in general, it's probably a good idea to get in the habit of using one of the two in your buffer-playing synthdefs. For this synth, we've added a <code>buffer</code> parameter.
</p>

<p>
One thing to note is that we don't actually send the buffer object itself to the synth. In SuperCollider, each buffer has a ID number. The server will only understand these IDs, and any other names or objects will likely result in an error. Fortunately, cl-collider (as well as the official SuperCollider client) automatically translates buffer objects to buffer IDs in most functions, so you usually don't have to do it manually. If you do, however, keep in mind that cl-collider's <code>bufnum</code> function is what is used to get a buffer's ID number.
</p>

<p>
After the <code>buffer</code> parameter, we provide another for the playback rate. <code>rate</code> is the number to multiply the buffer's original speed by. So <code>1</code> would play the buffer back at its normal speed, <code>2</code> would play it twice as fast (and one octave higher), and <code>0.5</code> would play it half as fast (one octave lower).
</p>

<p>
In this SynthDef, we also include a <code>start</code> parameter, which lets us pick where in the sample to start playing from. In the SynthDef, a <code>start</code> value of <code>0</code> means start from the beginning, while <code>0.5</code> means start playing halfway through the buffer. Most SuperCollider UGens that use buffers take the playback position as a frame number, but it's often more convenient to be able to specify the relative position in the file regardless of its sample rate, so we multiply <code>start</code> by the number of frames in the sample to make this possible.
</p>

<p>
The body of the SynthDef is fairly simple; the main UGen is <code>play-buf</code> which, as the name suggests, plays the buffer. Its first argument is the number of channels the buffer has. This is required by SuperCollider, and can't be modified while the synth is playing, or used as a parameter. It has to be a static number when the synth is compiled.
</p>

<p>
The second argument to <code>play-buf</code> is the buffer number. After that, the playback rate. Here we multiply our <code>rate</code> parameter by <code>(buf-rate-scale.ir buffer)</code>. <code>buf-rate-scale</code> is a UGen that outputs a number that we can multiply by in order to play a sample at its original speed regardless of the original file's sampling rate. If we just supplied our <code>rate</code> parameter directly, any sample that you load would play at the wrong speed if it doesn't match the sampling rate of the server itself.
</p>

<p>
You might also notice the <code>.ir</code> on the end of <code>buf-rate-scale</code>. <code>.ir</code> specifies that the UGen should "initialization rate": processed only once, when the synth is started. This frees up CPU usage, but it also gives us the disadvantage of not being able to change the buffer that the synth is playing while it's playing. Typically it's not necessary to change the buffer of an already-playing synth, but if you want that ability, you can just change the <code>.ir</code> to a <code>.kr</code>.
</p>

<p>
<code>start-pos</code> is the argument <code>play-buf</code> takes to specify where to start playing the sample from. Since <code>play-buf</code> expects a frame number for that parameter, we multiply our <code>start</code> parameter by the <code>buf-frames</code> UGen, which gives the total number of frames of the buffer. This is another <code>.ir</code> UGen for the same reason as above.
</p>

<p>
Finally, the <code>act</code> parameter specifies what action should be taken when <code>play-buf</code> finishes playing the sound. In our case, we provide <code>:free</code> so that the synth will stop playing and be freed. Without this, the synth would continue running in the background and continue using CPU resources even though it's making no sound. 
</p>

<p>
Of course, you may want to have the sound loop instead, in which case <code>act</code> would be left to its default value, so no special action is taken when the sound reaches its end. You would also have to provide <code>play-buf</code>'s <code>loop</code> parameter a value of <code>1</code>.
</p>

<p>
To actually play the <code>sample</code> synth, we'll want to make sure that we've saved the reference to the file we opened with <code>buffer-read</code> to a variable:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900;">defvar</span> <span style="color: #6c71c4;">*file*</span> <span style="color: #d33682;">(</span>buffer-read <span style="color: #2aa198;">"/path/to/your/file.wav"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
Then, we can start the <code>sample</code> synth like so:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #268bd2;">(</span>synth 'sample <span style="color: #268bd2;">:buffer</span> *file*<span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
As mentioned above, since <code>play-buf</code>'s <code>:act</code> argument is set to <code>:free</code>, the synth will automatically be freed when the sample finishes playing. Of course, if we had set the sample to loop, then it would continue looping indefinitely, or until we stop it manually. Because there is no <code>:gate</code> argument, the <code>release</code> function would have no effect, so we would have to call <code>stop</code> instead, to force it to stop.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Last updated: 2019-11-18 Mon 16:35</p>
</div>
</body>
</html>
